tangyangguang/Esp8266Base/src/Esp8266BaseMQTT.cpp
#include "Esp8266BaseOptions.h"
#if ESP8266BASE_USE_MQTT

#include "Esp8266BaseMQTT.h"
#include "Esp8266BaseStreamWrite.h"
#if ESP8266BASE_USE_WEB
#include "Esp8266BaseWeb.h"
#endif
#if ESP8266BASE_USE_JOURNAL
#include "Esp8266BaseJournal.h"
#endif
#include "Esp8266BaseLog.h"
#include "Esp8266BaseNTP.h"
#include "Esp8266BaseWiFi.h"
#if ESP8266BASE_USE_WATCHDOG
#include "Esp8266BaseWatchdog.h"
#endif
#include <WiFiClientSecureBearSSL.h>
#include <bearssl/bearssl_x509.h>

namespace Esp8266BaseMQTTInternal {
static BearSSL::WiFiClientSecure client;
static FixedOutbox outbox;
static bool mqttConnected = false;
static bool transportOpen = false;
static bool pingOutstanding = false;
static uint32_t connectDeadline = 0;
static uint32_t lastIoAt = 0;
static uint32_t pingDeadline = 0;
static uint32_t inFlightSentAt = 0;
static uint16_t nextPacketId = 0;
static int lastTlsCode = 0;
static char lastTlsText[80] = "";

struct RxState {
    uint8_t header;
    uint8_t remainingBytes;
    uint8_t control[8];
    bool remainingDone;
    uint32_t remainingLength;
    uint32_t multiplier;
    uint32_t bodyRead;
    uint16_t topicLength;
    uint16_t packetId;
    uint32_t payloadLength;
    uint32_t payloadRead;
    char topic[ESP8266BASE_MQTT_MAX_TOPIC_BYTES + 1];
    uint8_t payload[ESP8266BASE_MQTT_RX_CHUNK_BYTES];

    void reset() {
        header = 0;
        remainingBytes = 0;
        remainingDone = false;
        remainingLength = 0;
        multiplier = 1;
        bodyRead = 0;
        topicLength = 0;
        packetId = 0;
        payloadLength = 0;
        payloadRead = 0;
        topic[0] = '\0';
    }
};
static RxState rx;

static bool copyText(const char* source, char* target, size_t capacity, bool required) {
    if (!target || capacity == 0) return false;
    target[0] = '\0';
    if (!source || !source[0]) return !required;
    const size_t length = strlen(source);
    if (length >= capacity) return false;
    memcpy(target, source, length + 1);
    return true;
}

static uint16_t allocatePacketId() {
    ++nextPacketId;
    if (nextPacketId == 0) ++nextPacketId;
    return nextPacketId;
}

static uint8_t encodeRemainingLength(uint32_t value, uint8_t out[4]) {
    uint8_t used = 0;
    do {
        uint8_t byte = static_cast<uint8_t>(value % 128U);
        value /= 128U;
        if (value) byte |= 0x80U;
        out[used++] = byte;
    } while (value && used < 4);
    return used;
}

static bool writeExact(const uint8_t* data, size_t length) {
    if (length == 0) return true;
    if (!data || !transportOpen) return false;
    if (!Esp8266BaseInternal::writeAll(client, data, length, millis(),
                                       ESP8266BASE_MQTT_CONNECT_TIMEOUT_MS,
                                       []() { return millis(); }, []() { yield(); })) return false;
    lastIoAt = millis();
    return true;
}

static bool writeFixedHeader(uint8_t header, uint32_t remainingLength) {
    uint8_t encoded[5];
    encoded[0] = header;
    const uint8_t used = encodeRemainingLength(remainingLength, encoded + 1);
    return writeExact(encoded, static_cast<size_t>(used) + 1U);
}

static bool writeUint16(uint16_t value) {
    const uint8_t bytes[2] = {static_cast<uint8_t>(value >> 8),
                              static_cast<uint8_t>(value & 0xffU)};
    return writeExact(bytes, sizeof(bytes));
}

static bool writeString(const char* text) {
    const size_t length = text ? strlen(text) : 0;
    return length <= 65535U && writeUint16(static_cast<uint16_t>(length)) &&
           writeExact(reinterpret_cast<const uint8_t*>(text), length);
}

static bool writeBinaryString(const uint8_t* data, size_t length) {
    return length <= 65535U && writeUint16(static_cast<uint16_t>(length)) &&
           writeExact(data, length);
}

static bool sendAck(uint8_t type, uint16_t packetId) {
    return writeFixedHeader(type, 2) && writeUint16(packetId);
}

static bool permanentCertificateError(int code) {
    return code >= BR_ERR_X509_INVALID_VALUE && code <= BR_ERR_X509_NOT_TRUSTED;
}
}  // namespace Esp8266BaseMQTTInternal

using namespace Esp8266BaseMQTTInternal;

Esp8266BaseMQTTPrepareCallback Esp8266BaseMQTT::_prepareCallback = nullptr;
bool Esp8266BaseMQTT::_configured = false;
bool Esp8266BaseMQTT::_begun = false;
bool Esp8266BaseMQTT::_shutdownActive = false;
bool Esp8266BaseMQTT::_reconnectRequested = false;
bool Esp8266BaseMQTT::_connectAttemptsEnabled = true;
Esp8266BaseMQTTState Esp8266BaseMQTT::_state = Esp8266BaseMQTTState::UNCONFIGURED;
Esp8266BaseMQTTDisconnectReason Esp8266BaseMQTT::_lastReason = Esp8266BaseMQTTDisconnectReason::NONE;
uint32_t Esp8266BaseMQTT::_attemptCount = 0;
uint32_t Esp8266BaseMQTT::_retryAt = 0;
uint32_t Esp8266BaseMQTT::_retryDelay = ESP8266BASE_MQTT_RETRY_INITIAL_MS;
uint32_t Esp8266BaseMQTT::_lastWifiRecoveryAt = 0;
uint8_t Esp8266BaseMQTT::_consecutiveTransportFailures = 0;
bool Esp8266BaseMQTT::_recoveryActive = false;
uint32_t Esp8266BaseMQTT::_recoveryStartedAt = 0;
uint32_t Esp8266BaseMQTT::_restartRetryAt = 0;
uint8_t Esp8266BaseMQTT::_recoveryRadioResetBaseline = 0;
uint16_t Esp8266BaseMQTT::_recoveryFailureCount = 0;
Esp8266BaseMQTTRecoveryReport Esp8266BaseMQTT::_lastRecoveryReport = {};
Esp8266BaseMQTTShutdownResult Esp8266BaseMQTT::_shutdownResult = Esp8266BaseMQTTShutdownResult::NONE;
uint16_t Esp8266BaseMQTT::_shutdownPacketId = 0;
uint32_t Esp8266BaseMQTT::_shutdownDeadline = 0;
char Esp8266BaseMQTT::_host[65] = "";
char Esp8266BaseMQTT::_clientId[49] = "";
char Esp8266BaseMQTT::_username[65] = "";
char Esp8266BaseMQTT::_password[97] = "";
char Esp8266BaseMQTT::_willTopic[129] = "";
const uint8_t* Esp8266BaseMQTT::_willPayload = nullptr;
uint16_t Esp8266BaseMQTT::_port = 0;
uint16_t Esp8266BaseMQTT::_keepAlive = 30;
bool Esp8266BaseMQTT::_cleanSession = true;
size_t Esp8266BaseMQTT::_willLength = 0;
uint8_t Esp8266BaseMQTT::_willQos = 0;
bool Esp8266BaseMQTT::_willRetain = false;
const BearSSL::X509List* Esp8266BaseMQTT::_trustAnchors = nullptr;
Esp8266BaseMQTTConnectedCallback Esp8266BaseMQTT::_connectedCallback = nullptr;
Esp8266BaseMQTTDisconnectedCallback Esp8266BaseMQTT::_disconnectedCallback = nullptr;
Esp8266BaseMQTTMessageCallback Esp8266BaseMQTT::_messageCallback = nullptr;
Esp8266BaseMQTTSubscribeAckCallback Esp8266BaseMQTT::_subscribeAckCallback = nullptr;
Esp8266BaseMQTTPublishAckCallback Esp8266BaseMQTT::_publishAckCallback = nullptr;
Esp8266BaseMQTTClientErrorCallback Esp8266BaseMQTT::_clientErrorCallback = nullptr;

bool Esp8266BaseMQTT::configure(const Esp8266BaseMQTTConfig& config) {
    if (_begun) return false;
    const bool stringsOk = copyText(config.host, _host, sizeof(_host), true) &&
        copyText(config.clientId, _clientId, sizeof(_clientId), true) &&
        copyText(config.username, _username, sizeof(_username), false) &&
        copyText(config.password, _password, sizeof(_password), false) &&
        copyText(config.willTopic, _willTopic, sizeof(_willTopic), false);
    const bool credentialsOk = !config.password || !config.password[0] ||
        (config.username && config.username[0]);
    const bool willOk = validWill(config.willTopic, config.willPayload,
                                  config.willPayloadLength, config.willQos);
    const bool requiredOk = config.port && config.keepAliveSeconds && config.trustAnchors;
    if (!stringsOk || !credentialsOk || !willOk || !requiredOk) {
        _configured = false;
        _state = Esp8266BaseMQTTState::UNCONFIGURED;
        ESP8266BASE_LOG_E_P("MQTT", "configure_rejected reason=invalid_or_oversize_config");
        return false;
    }
    _willPayload = config.willPayload;
    _willLength = config.willPayloadLength;
    _willQos = config.willQos;
    _willRetain = config.willRetain;
    _port = config.port;
    _keepAlive = config.keepAliveSeconds;
    _cleanSession = config.cleanSession;
    _trustAnchors = config.trustAnchors;
    _configured = true;
    _state = Esp8266BaseMQTTState::WAITING_WIFI;
    ESP8266BASE_LOG_I_P("MQTT", "configured host=%s port=%u client_id=%s keepalive=%us clean_session=%s tx_slots=%u max_payload=%u rx_chunk=%u",
        _host, static_cast<unsigned>(_port), _clientId, static_cast<unsigned>(_keepAlive),
        _cleanSession ? "yes" : "no", static_cast<unsigned>(ESP8266BASE_MQTT_TX_SLOTS),
        static_cast<unsigned>(ESP8266BASE_MQTT_MAX_PAYLOAD_BYTES),
        static_cast<unsigned>(ESP8266BASE_MQTT_RX_CHUNK_BYTES));
    return true;
}

bool Esp8266BaseMQTT::setPrepareCallback(Esp8266BaseMQTTPrepareCallback callback) {
    if (_begun) return false;
    _prepareCallback = callback;
    return true;
}

bool Esp8266BaseMQTT::_prepareWill() {
    if (!_prepareCallback) return true;
    Esp8266BaseMQTTWill will = {_willTopic, _willPayload, _willLength, _willQos, _willRetain};
    if (!_prepareCallback(will) ||
        !validWill(will.topic, will.payload, will.length, will.qos) ||
        (will.topic && strlen(will.topic) >= sizeof(_willTopic))) return false;
    // memmove permits the unchanged borrowed topic (or a suffix of it).
    const size_t topicLength = will.topic ? strlen(will.topic) : 0;
    if (topicLength) memmove(_willTopic, will.topic, topicLength);
    _willTopic[topicLength] = '\0';
    _willPayload = will.payload;
    _willLength = will.length;
    _willQos = will.qos;
    _willRetain = will.retain;
    return true;
}

void Esp8266BaseMQTT::setCallbacks(Esp8266BaseMQTTConnectedCallback connected,
    Esp8266BaseMQTTDisconnectedCallback disconnected, Esp8266BaseMQTTMessageCallback message,
    Esp8266BaseMQTTSubscribeAckCallback subscribeAck,
    Esp8266BaseMQTTPublishAckCallback publishAck,
    Esp8266BaseMQTTClientErrorCallback clientError) {
    _connectedCallback = connected;
    _disconnectedCallback = disconnected;
    _messageCallback = message;
    _subscribeAckCallback = subscribeAck;
    _publishAckCallback = publishAck;
    _clientErrorCallback = clientError;
}

