tangyangguang/Esp8266Base/src/Esp8266BaseMQTT.cpp
bool Esp8266BaseMQTT::begin() {
    _begun = true;
    outbox.clear();
    rx.reset();
    if (!_configured) {
        _state = Esp8266BaseMQTTState::UNCONFIGURED;
        return false;
    }
    client.setTrustAnchors(_trustAnchors);
    client.setBufferSizes(4096, 1024);
    client.setTimeout(ESP8266BASE_MQTT_CONNECT_TIMEOUT_MS);
    client.setNoDelay(true);
    _retryAt = millis();
    _consecutiveTransportFailures = 0;
    _recoveryActive = false;
    _recoveryStartedAt = 0;
    _restartRetryAt = 0;
    _recoveryRadioResetBaseline = Esp8266BaseWiFi::radioResetCount();
    _recoveryFailureCount = 0;
    _lastRecoveryReport = Esp8266BaseMQTTRecoveryReport{};
#if ESP8266BASE_USE_WATCHDOG
    Esp8266BaseWatchdog::setApplicationReady(false);
#endif
    ESP8266BASE_LOG_I_P("MQTT", "mqtt_transport_ready implementation=fixed_sync_tls tls_buffers=4096/1024 heap_outbox=no heap_packet_buffer=no");
    return true;
}

void Esp8266BaseMQTT::handle() {
    if (!_begun || !_configured) return;
    if (_shutdownActive) return _handleShutdown();
    _handleEscalatedRecovery(millis());
    if (!Esp8266BaseWiFi::isConnected()) return _disconnectForGate(Esp8266BaseMQTTState::WAITING_WIFI);
    if (!Esp8266BaseNTP::isSynced()) return _disconnectForGate(Esp8266BaseMQTTState::WAITING_TIME);
    if (_reconnectRequested) {
        _reconnectRequested = false;
        _closeTransport(Esp8266BaseMQTTDisconnectReason::USER_OK, true);
        return;
    }
    if (transportOpen) {
        if (!_pumpTransport()) {
            const Esp8266BaseMQTTDisconnectReason reason =
                _lastReason == Esp8266BaseMQTTDisconnectReason::NONE
                    ? Esp8266BaseMQTTDisconnectReason::TCP_DISCONNECTED : _lastReason;
            _closeTransport(reason, true);
        }
        return;
    }
    if (!_connectAttemptsEnabled || !_isDue(millis(), _retryAt)) {
        _state = Esp8266BaseMQTTState::BACKOFF;
        return;
    }
#if ESP8266BASE_USE_WEB
    // Defer new DNS/TCP/TLS handshakes while a local Web request was served
    // recently: handshake allocations and Web response peaks must not overlap.
    // Established connections are unaffected; the attempt resumes next loop.
    {
        const uint32_t webLast = Esp8266BaseWeb::lastActivityMs();
        if (webLast != 0U && (millis() - webLast) < 3000UL) {
            _state = Esp8266BaseMQTTState::BACKOFF;
            return;
        }
    }
#endif
    if (!_prepareWill()) {
        _lastReason = Esp8266BaseMQTTDisconnectReason::PREPARE_REJECTED;
        ESP8266BASE_LOG_W_P("MQTT", "connect_prepare_rejected action=backoff");
        _scheduleRetry();
        return;
    }
    // Core's make_shared allocation can abort on OOM before BearSSL's null
    // checks run. Reserve the complete simultaneous TLS allocation set, not
    // merely its largest individual buffer. Sizes follow the selected Core.
    // setBufferSizes adds 325/85 bytes; allow allocator/shared_ptr overhead.
    constexpr size_t tlsBytes = sizeof(br_ssl_client_context) +
        sizeof(br_x509_minimal_context) + 4096U + 325U + 1024U + 85U + 64U;
    constexpr size_t tlsRounded = (tlsBytes + 1023U) & ~size_t(1023U);
    constexpr size_t requiredHeap = tlsRounded + 4096U;
    constexpr size_t contextBytes = sizeof(br_ssl_client_context) > sizeof(br_x509_minimal_context)
        ? sizeof(br_ssl_client_context) : sizeof(br_x509_minimal_context);
    constexpr size_t largestAllocation = contextBytes > 4421U ? contextBytes : 4421U;
    // The independent allocations need not share a single contiguous block.
    // Requiring the entire working set contiguously would strand a healthy,
    // fragmented heap after Web traffic. Keep margin around the largest one.
    constexpr size_t requiredBlock = ((largestAllocation + 64U + 1023U) & ~size_t(1023U)) + 2048U;
    const size_t availableHeap = ESP.getFreeHeap();
    const size_t availableBlock = ESP.getMaxFreeBlockSize();
    if (availableHeap < requiredHeap || availableBlock < requiredBlock) {
        _state = Esp8266BaseMQTTState::BACKOFF;
        _retryAt = millis() + 5000UL;
        ESP8266BASE_LOG_I_P("MQTT", "tls_heap_deferred heap=%u block=%u need=%u/%u",
            static_cast<unsigned>(availableHeap), static_cast<unsigned>(availableBlock),
            static_cast<unsigned>(requiredHeap), static_cast<unsigned>(requiredBlock));
        return; // Not a connection attempt or recovery failure.
    }
    if (_attemptCount < 0xffffffffUL) ++_attemptCount;
#if ESP8266BASE_USE_JOURNAL
    Esp8266BaseJournal::record(JNL_MQTT_ATTEMPT, 0,
                               static_cast<int16_t>(_attemptCount & 0x7FFFU), 0, 0);
#endif
    ESP8266BASE_LOG_I_P("MQTT", "connect_attempt attempt=%lu host=%s port=%u free_heap=%u max_block=%u",
        static_cast<unsigned long>(_attemptCount), _host, static_cast<unsigned>(_port),
        static_cast<unsigned>(ESP.getFreeHeap()), static_cast<unsigned>(ESP.getMaxFreeBlockSize()));
    if (!_connectTransport()) {
        _lastReason = permanentCertificateError(lastTlsCode)
            ? Esp8266BaseMQTTDisconnectReason::TLS_BAD_FINGERPRINT
            : Esp8266BaseMQTTDisconnectReason::TCP_DISCONNECTED;
        _noteRecoveryFailure(_lastReason);
        if (!Esp8266BaseWiFi::isConnected()) {
            _state = Esp8266BaseMQTTState::WAITING_WIFI;
            return;
        }
        _scheduleRetry();
    }
}

bool Esp8266BaseMQTT::_connectTransport() {
    lastTlsCode = 0;
    lastTlsText[0] = '\0';
    rx.reset();
    if (!client.connect(_host, _port)) {
        _captureTlsError();
        ESP8266BASE_LOG_W_P("MQTT", "transport_connect_failed tls_code=%d tls_error=%s",
                          lastTlsCode, lastTlsText[0] ? lastTlsText : "none");
        client.stop();
        return false;
    }
    transportOpen = true;
    mqttConnected = false;
    pingOutstanding = false;
    lastIoAt = millis();
    uint32_t remaining = 10U + 2U + strlen(_clientId);
    const uint8_t flags = connectFlags(_cleanSession, _willTopic[0], _willQos,
                                       _willRetain, _username[0], _password[0]);
    if (_willTopic[0]) {
        remaining += 2U + strlen(_willTopic) + 2U + _willLength;
    }
    if (_username[0]) remaining += 2U + strlen(_username);
    if (_password[0]) remaining += 2U + strlen(_password);
    const uint8_t protocol[] = {0, 4, 'M', 'Q', 'T', 'T', 4};
    const uint8_t tail[] = {flags, static_cast<uint8_t>(_keepAlive >> 8),
                            static_cast<uint8_t>(_keepAlive & 0xffU)};
    bool ok = writeFixedHeader(0x10, remaining) && writeExact(protocol, sizeof(protocol)) &&
        writeExact(tail, sizeof(tail)) && writeString(_clientId);
    if (ok && _willTopic[0]) ok = writeString(_willTopic) && writeBinaryString(_willPayload, _willLength);
    if (ok && _username[0]) ok = writeString(_username);
    if (ok && _password[0]) ok = writeString(_password);
    if (!ok) {
        _captureTlsError();
        client.stop();
        transportOpen = false;
        return false;
    }
    connectDeadline = millis() + ESP8266BASE_MQTT_CONNECT_TIMEOUT_MS;
    _state = Esp8266BaseMQTTState::CONNECTING;
    return true;
}

bool Esp8266BaseMQTT::_pumpTransport() {
    if (!client.connected() || !_pumpIncoming() || !_pumpOutbox()) return false;
    const uint32_t now = millis();
    if (!mqttConnected) {
        if (_isDue(now, connectDeadline)) {
            ESP8266BASE_LOG_W_P("MQTT", "connack_timeout timeout_ms=%lu",
                              static_cast<unsigned long>(ESP8266BASE_MQTT_CONNECT_TIMEOUT_MS));
            return false;
        }
        return true;
    }
    const FixedPacket* pending = outbox.inFlight();
    if (pending && _isDue(now, inFlightSentAt + ESP8266BASE_MQTT_ACK_TIMEOUT_MS)) {
        _onClientError(pending->packetId, Esp8266BaseMQTTClientError::MAX_RETRIES);
        return false;
    }
    const uint32_t keepAliveMs = static_cast<uint32_t>(_keepAlive) * 1000UL;
    if (pingOutstanding) {
        if (_isDue(now, pingDeadline)) return false;
    } else if (_isDue(now, lastIoAt + keepAliveMs)) {
        const uint8_t ping[] = {0xc0, 0};
        if (!writeExact(ping, sizeof(ping))) return false;
        pingOutstanding = true;
        pingDeadline = now + keepAliveMs;
    }
    return true;
}

bool Esp8266BaseMQTT::_pumpOutbox() {
    if (!mqttConnected) return true;
    FixedPacket* packet = outbox.nextToSend();
    if (!packet) return true;
    bool ok = false;
    if (packet->kind == PacketKind::SUBSCRIBE) {
        const uint32_t remaining = 5U + strlen(packet->topic);
        ok = writeFixedHeader(0x82, remaining) && writeUint16(packet->packetId) &&
             writeString(packet->topic) && writeExact(&packet->qos, 1);
    } else if (packet->kind == PacketKind::PUBLISH) {
        const uint32_t remaining = 2U + strlen(packet->topic) + (packet->qos ? 2U : 0U) + packet->payloadLength;
        const uint8_t header = 0x30U | (packet->retain ? 1U : 0U) |
            (packet->qos ? 2U : 0U) | (packet->dup ? 8U : 0U);
        ok = writeFixedHeader(header, remaining) && writeString(packet->topic) &&
            (!packet->qos || writeUint16(packet->packetId)) &&
            writeExact(packet->payloadHead, packet->payloadHeadLength()) &&
            writeExact(packet->payloadTail, packet->payloadTailLength());
    }
    if (!ok) return false;
    const bool waits = packet->qos != 0;
    outbox.markSent(packet);
    if (waits) inFlightSentAt = millis();
    return true;
}

