tangyangguang/Esp8266Base/src/Esp8266BaseMQTT.cpp
bool Esp8266BaseMQTT::_pumpIncoming() {
    uint16_t budget = 512;
    // A PINGRESP has a zero-byte body. Once its remaining-length byte is read,
    // the TLS socket can have no further available bytes; still process the
    // complete control packet instead of waiting forever for another packet.
    while (budget &&
           (controlPacketReady(rx.header, rx.remainingDone,
                               rx.bodyRead, rx.remainingLength) ||
            client.available() > 0)) {
        if (!rx.header) {
            const int value = client.read();
            if (value < 0) break;
            rx.header = static_cast<uint8_t>(value);
            --budget;
            continue;
        }
        if (!rx.remainingDone) {
            const int value = client.read();
            if (value < 0) break;
            const uint8_t byte = static_cast<uint8_t>(value);
            rx.remainingLength += static_cast<uint32_t>(byte & 0x7fU) * rx.multiplier;
            rx.multiplier *= 128U;
            ++rx.remainingBytes;
            --budget;
            if (byte & 0x80U) {
                if (rx.remainingBytes >= 4) return false;
                continue;
            }
            rx.remainingDone = true;
            if ((rx.header >> 4) != 3 && rx.remainingLength > sizeof(rx.control)) return false;
            continue;
        }
        const uint8_t type = rx.header >> 4;
        if (type != 3) {
            while (budget && client.available() > 0 && rx.bodyRead < rx.remainingLength) {
                rx.control[rx.bodyRead++] = static_cast<uint8_t>(client.read());
                --budget;
            }
            if (rx.bodyRead < rx.remainingLength) break;
            const uint8_t header = rx.header;
            const uint32_t length = rx.remainingLength;
            uint8_t control[8];
            memcpy(control, rx.control, length);
            rx.reset();
            lastIoAt = millis();
            if (type == 2 && header == 0x20 && length == 2) {
                if (control[1]) {
                    static const Esp8266BaseMQTTDisconnectReason reasons[] = {
                        Esp8266BaseMQTTDisconnectReason::NONE,
                        Esp8266BaseMQTTDisconnectReason::UNACCEPTABLE_PROTOCOL,
                        Esp8266BaseMQTTDisconnectReason::IDENTIFIER_REJECTED,
                        Esp8266BaseMQTTDisconnectReason::SERVER_UNAVAILABLE,
                        Esp8266BaseMQTTDisconnectReason::MALFORMED_CREDENTIALS,
                        Esp8266BaseMQTTDisconnectReason::NOT_AUTHORIZED};
                    _lastReason = control[1] < sizeof(reasons) / sizeof(reasons[0])
                        ? reasons[control[1]] : Esp8266BaseMQTTDisconnectReason::UNKNOWN;
                    ESP8266BASE_LOG_W_P("MQTT", "connack_rejected return_code=%u reason=%s",
                                      static_cast<unsigned>(control[1]), lastDisconnectReasonName());
                    return false;
                }
                _onConnect((control[0] & 1U) != 0);
            } else if (type == 4 && header == 0x40 && length == 2) {
                _onPublishAck(static_cast<uint16_t>((control[0] << 8) | control[1]));
            } else if (type == 9 && header == 0x90 && length >= 3) {
                const uint16_t id = static_cast<uint16_t>((control[0] << 8) | control[1]);
                if (outbox.acknowledge(PacketKind::SUBSCRIBE, id)) {
                    _onSubscribeAck(id, control + 2, length - 2U);
                }
                else ESP8266BASE_LOG_W_P("MQTT", "suback_ignored packet_id=%u", static_cast<unsigned>(id));
            } else if (type == 13 && header == 0xd0 && length == 0) {
                pingOutstanding = false;
            } else {
                _onClientError(0, Esp8266BaseMQTTClientError::PROTOCOL_ERROR);
                return false;
            }
            continue;
        }
        const uint8_t qos = static_cast<uint8_t>((rx.header >> 1) & 3U);
        if (qos > 1) return false;
        while (budget && client.available() > 0 && rx.bodyRead < 2) {
            rx.control[rx.bodyRead++] = static_cast<uint8_t>(client.read());
            --budget;
            if (rx.bodyRead == 2) {
                rx.topicLength = static_cast<uint16_t>((rx.control[0] << 8) | rx.control[1]);
                if (!rx.topicLength || rx.topicLength > ESP8266BASE_MQTT_MAX_TOPIC_BYTES ||
                    rx.remainingLength < 2U + rx.topicLength + (qos ? 2U : 0U)) return false;
                rx.payloadLength = rx.remainingLength - 2U - rx.topicLength - (qos ? 2U : 0U);
                if (rx.payloadLength > ESP8266BASE_MQTT_MAX_INBOUND_PAYLOAD_BYTES) return false;
            }
        }
        while (budget && client.available() > 0 && rx.bodyRead < 2U + rx.topicLength) {
            rx.topic[rx.bodyRead - 2U] = static_cast<char>(client.read());
            ++rx.bodyRead;
            --budget;
            if (rx.bodyRead == 2U + rx.topicLength) rx.topic[rx.topicLength] = '\0';
        }
        while (qos && budget && client.available() > 0 && rx.bodyRead < 4U + rx.topicLength) {
            rx.packetId = static_cast<uint16_t>((rx.packetId << 8) | static_cast<uint8_t>(client.read()));
            ++rx.bodyRead;
            --budget;
        }
        const uint32_t headerBytes = 2U + rx.topicLength + (qos ? 2U : 0U);
        if (rx.bodyRead < headerBytes) break;
        if (qos && rx.packetId == 0) return false;
        if (rx.payloadRead < rx.payloadLength && budget && client.available() > 0) {
            size_t chunk = rx.payloadLength - rx.payloadRead;
            if (chunk > sizeof(rx.payload)) chunk = sizeof(rx.payload);
            if (chunk > budget) chunk = budget;
            if (chunk > static_cast<size_t>(client.available())) chunk = client.available();
            const int count = client.read(rx.payload, chunk);
            if (count <= 0) break;
            _onMessage(qos, (rx.header & 8U) != 0, (rx.header & 1U) != 0,
                rx.packetId, rx.topic, rx.payload, count, rx.payloadRead, rx.payloadLength);
            rx.payloadRead += count;
            rx.bodyRead += count;
            budget -= count;
        }
        if (rx.payloadRead < rx.payloadLength) break;
        const uint16_t id = rx.packetId;
        if (rx.payloadLength == 0) _onMessage(qos, (rx.header & 8U) != 0,
            (rx.header & 1U) != 0, id, rx.topic, rx.payload, 0, 0, 0);
        rx.reset();
        lastIoAt = millis();
        if (qos == 1 && !sendAck(0x40, id)) return false;
    }
    return true;
}

uint16_t Esp8266BaseMQTT::publish(const char* topic, uint8_t qos, bool retain,
    const uint8_t* payload, size_t length) {
    return publish(topic, qos, retain, payload, length, Esp8266BaseMQTTPublishPriority::STATE);
}

uint16_t Esp8266BaseMQTT::publish(const char* topic, uint8_t qos, bool retain,
    const uint8_t* payload, size_t length, Esp8266BaseMQTTPublishPriority priority) {
    if (_shutdownActive || !mqttConnected || !topic || qos > 1 || (length && !payload)) return 0;
    const uint16_t id = qos ? allocatePacketId() : 0;
    if (!outbox.enqueuePublish(id, topic, qos, retain, payload, length, priority)) {
        _onClientError(id, (strlen(topic) > ESP8266BASE_MQTT_MAX_TOPIC_BYTES ||
            length > ESP8266BASE_MQTT_MAX_PAYLOAD_BYTES)
            ? Esp8266BaseMQTTClientError::PACKET_TOO_LARGE
            : Esp8266BaseMQTTClientError::CAPACITY_EXHAUSTED);
        return 0;
    }
    return id;
}

uint16_t Esp8266BaseMQTT::publish(const char* topic, uint8_t qos, bool retain, const char* payload) {
    return payload ? publish(topic, qos, retain, reinterpret_cast<const uint8_t*>(payload), strlen(payload)) : 0;
}

uint16_t Esp8266BaseMQTT::publish(const char* topic, uint8_t qos, bool retain,
    const char* payload, Esp8266BaseMQTTPublishPriority priority) {
    return payload ? publish(topic, qos, retain, reinterpret_cast<const uint8_t*>(payload), strlen(payload), priority) : 0;
}

uint16_t Esp8266BaseMQTT::subscribe(const char* topic, uint8_t qos) {
    if (_shutdownActive || !mqttConnected || !topic || qos > 1) return 0;
    const uint16_t id = allocatePacketId();
    if (!outbox.enqueueSubscribe(id, topic, qos)) {
        _onClientError(id, strlen(topic) > ESP8266BASE_MQTT_MAX_TOPIC_BYTES
            ? Esp8266BaseMQTTClientError::PACKET_TOO_LARGE
            : Esp8266BaseMQTTClientError::CAPACITY_EXHAUSTED);
        return 0;
    }
    return id;
}

bool Esp8266BaseMQTT::requestReconnect(bool recoveryFailure) {
    if (!_configured || !_begun || _shutdownActive) return false;
    if (recoveryFailure) _noteRecoveryFailure(Esp8266BaseMQTTDisconnectReason::TCP_DISCONNECTED);
    _reconnectRequested = true;
    return true;
}

bool Esp8266BaseMQTT::markConnectionReady() {
    if (!_configured || !_begun || _shutdownActive || _reconnectRequested || !mqttConnected) return false;
    _retryDelay = ESP8266BASE_MQTT_RETRY_INITIAL_MS;
    if (_recoveryActive) {
        const uint32_t durationSeconds = (millis() - _recoveryStartedAt) / 1000UL;
        const uint8_t radioResets = static_cast<uint8_t>(
            Esp8266BaseWiFi::radioResetCount() - _recoveryRadioResetBaseline);
        ++_lastRecoveryReport.serial;
        if (_lastRecoveryReport.serial == 0) ++_lastRecoveryReport.serial;
        _lastRecoveryReport.durationSeconds = durationSeconds;
        _lastRecoveryReport.failureCycles = _recoveryFailureCount;
        _lastRecoveryReport.radioResetCount = radioResets;
#if ESP8266BASE_USE_JOURNAL
        Esp8266BaseJournal::record(JNL_RECOVERY, 1, 0,
            static_cast<uint16_t>(durationSeconds > 0xFFFFU ? 0xFFFFU : durationSeconds),
            Esp8266BaseWiFi::radioResetCount());
#endif
        ESP8266BASE_LOG_I_P("MQTT", "application_connection_recovered duration_s=%lu failures=%u radio_resets=%u",
                          static_cast<unsigned long>(durationSeconds),
                          static_cast<unsigned>(_recoveryFailureCount),
                          static_cast<unsigned>(radioResets));
    }
    _consecutiveTransportFailures = 0;
    _recoveryFailureCount = 0;
    _recoveryActive = false;
    _recoveryStartedAt = 0;
    _restartRetryAt = 0;
#if ESP8266BASE_USE_WATCHDOG
    Esp8266BaseWatchdog::setApplicationReady(true);
#endif
    return true;
}

bool Esp8266BaseMQTT::recoveryReport(uint32_t afterSerial,
                                     Esp8266BaseMQTTRecoveryReport& report) {
    if (_lastRecoveryReport.serial == 0 ||
        _lastRecoveryReport.serial == afterSerial) return false;
    report = _lastRecoveryReport;
    return true;
}

void Esp8266BaseMQTT::setConnectAttemptsEnabled(bool enabled) { _connectAttemptsEnabled = enabled; }
bool Esp8266BaseMQTT::connectAttemptsEnabled() { return _connectAttemptsEnabled; }
bool Esp8266BaseMQTT::connected() { return !_shutdownActive && mqttConnected; }
bool Esp8266BaseMQTT::isConfigured() { return _configured; }
Esp8266BaseMQTTState Esp8266BaseMQTT::state() { return _state; }
uint32_t Esp8266BaseMQTT::attemptCount() { return _attemptCount; }
uint32_t Esp8266BaseMQTT::nextAttemptAt() { return _retryAt; }
Esp8266BaseMQTTDisconnectReason Esp8266BaseMQTT::lastDisconnectReason() { return _lastReason; }
int Esp8266BaseMQTT::lastTlsErrorCode() { return lastTlsCode; }
const char* Esp8266BaseMQTT::lastTlsErrorText() { return lastTlsText; }
size_t Esp8266BaseMQTT::queuedPackets() { return outbox.size(); }

const char* Esp8266BaseMQTT::stateName() {
    switch (_state) {
        case Esp8266BaseMQTTState::UNCONFIGURED: return "unconfigured";
        case Esp8266BaseMQTTState::WAITING_WIFI: return "waiting_wifi";
        case Esp8266BaseMQTTState::WAITING_TIME: return "waiting_time";
        case Esp8266BaseMQTTState::BACKOFF: return "backoff";
        case Esp8266BaseMQTTState::CONNECTING: return "connecting";
        case Esp8266BaseMQTTState::CONNECTED: return "connected";
        case Esp8266BaseMQTTState::SHUTDOWN_WAIT_ACK: return "shutdown_wait_ack";
        case Esp8266BaseMQTTState::SHUTDOWN_DISCONNECTING: return "shutdown_disconnecting";
        case Esp8266BaseMQTTState::PAUSED: return "paused";
        default: return "unknown";
    }
}

const char* Esp8266BaseMQTT::lastDisconnectReasonName() {
    switch (_lastReason) {
        case Esp8266BaseMQTTDisconnectReason::NONE: return "none";
        case Esp8266BaseMQTTDisconnectReason::USER_OK: return "user_ok";
        case Esp8266BaseMQTTDisconnectReason::UNACCEPTABLE_PROTOCOL: return "unacceptable_protocol";
        case Esp8266BaseMQTTDisconnectReason::IDENTIFIER_REJECTED: return "identifier_rejected";
        case Esp8266BaseMQTTDisconnectReason::SERVER_UNAVAILABLE: return "server_unavailable";
        case Esp8266BaseMQTTDisconnectReason::MALFORMED_CREDENTIALS: return "malformed_credentials";
        case Esp8266BaseMQTTDisconnectReason::NOT_AUTHORIZED: return "not_authorized";
        case Esp8266BaseMQTTDisconnectReason::TLS_BAD_FINGERPRINT: return "tls_bad_fingerprint";
        case Esp8266BaseMQTTDisconnectReason::TCP_DISCONNECTED: return "tcp_disconnected";
        case Esp8266BaseMQTTDisconnectReason::PREPARE_REJECTED: return "prepare_rejected";
        default: return "unknown";
    }
}

bool Esp8266BaseMQTT::beginShutdown(const char* topic, const uint8_t* payload,
    size_t length, uint32_t timeoutMs) {
    if (_shutdownActive) return false;
    if (!_configured || !_begun || !mqttConnected) {
        _shutdownResult = Esp8266BaseMQTTShutdownResult::NOT_CONNECTED;
        _shutdownActive = true;
        _state = Esp8266BaseMQTTState::PAUSED;
        return false;
    }
    if (!topic || !topic[0] || (length && !payload) || !timeoutMs || timeoutMs > 0x7fffffffUL) {
        _shutdownResult = Esp8266BaseMQTTShutdownResult::INVALID_ARGUMENT;
        return false;
    }
    const uint16_t id = allocatePacketId();
    if (!outbox.enqueuePublish(id, topic, 1, true, payload, length,
                               Esp8266BaseMQTTPublishPriority::CRITICAL)) {
        _shutdownResult = Esp8266BaseMQTTShutdownResult::PUBLISH_FAILED;
        return false;
    }
    _reconnectRequested = false;
    _shutdownActive = true;
    _shutdownResult = Esp8266BaseMQTTShutdownResult::IN_PROGRESS;
    _shutdownPacketId = id;
    _shutdownDeadline = millis() + timeoutMs;
    _state = Esp8266BaseMQTTState::SHUTDOWN_WAIT_ACK;
    ESP8266BASE_LOG_I_P("MQTT", "shutdown_started packet_id=%u timeout_ms=%lu",
                      static_cast<unsigned>(id), static_cast<unsigned long>(timeoutMs));
    return true;
}

bool Esp8266BaseMQTT::beginShutdown(const char* topic, const char* payload, uint32_t timeoutMs) {
    return payload && beginShutdown(topic, reinterpret_cast<const uint8_t*>(payload), strlen(payload), timeoutMs);
}

Esp8266BaseMQTTShutdownResult Esp8266BaseMQTT::shutdownResult() { return _shutdownResult; }
const char* Esp8266BaseMQTT::shutdownResultName() {
    switch (_shutdownResult) {
        case Esp8266BaseMQTTShutdownResult::NONE: return "none";
        case Esp8266BaseMQTTShutdownResult::IN_PROGRESS: return "in_progress";
        case Esp8266BaseMQTTShutdownResult::SUCCESS: return "success";
        case Esp8266BaseMQTTShutdownResult::NOT_CONNECTED: return "not_connected";
        case Esp8266BaseMQTTShutdownResult::INVALID_ARGUMENT: return "invalid_argument";
        case Esp8266BaseMQTTShutdownResult::PUBLISH_FAILED: return "publish_failed";
        case Esp8266BaseMQTTShutdownResult::CONNECTION_LOST: return "connection_lost";
        case Esp8266BaseMQTTShutdownResult::PUBACK_TIMEOUT: return "puback_timeout";
        case Esp8266BaseMQTTShutdownResult::DISCONNECT_FAILED: return "disconnect_failed";
        case Esp8266BaseMQTTShutdownResult::DISCONNECT_TIMEOUT: return "disconnect_timeout";
        default: return "unknown";
    }
}

