tangyangguang/Esp8266Base/src/Esp8266BaseMQTT.cpp
bool Esp8266BaseMQTT::shutdownSucceeded() {
    return _shutdownActive && _state == Esp8266BaseMQTTState::PAUSED &&
           _shutdownResult == Esp8266BaseMQTTShutdownResult::SUCCESS;
}
bool Esp8266BaseMQTT::shutdownPaused() { return _shutdownActive; }

void Esp8266BaseMQTT::_handleShutdown() {
    if (_state == Esp8266BaseMQTTState::PAUSED) return;
    if (!transportOpen || !client.connected()) {
        _closeTransport(Esp8266BaseMQTTDisconnectReason::TCP_DISCONNECTED, false);
        _finishShutdown(Esp8266BaseMQTTShutdownResult::CONNECTION_LOST);
        return;
    }
    const bool pumped = _pumpTransport();
    if (_state == Esp8266BaseMQTTState::PAUSED) return;
    if (!pumped) {
        _closeTransport(Esp8266BaseMQTTDisconnectReason::TCP_DISCONNECTED, false);
        _finishShutdown(Esp8266BaseMQTTShutdownResult::CONNECTION_LOST);
        return;
    }
    if (_state == Esp8266BaseMQTTState::SHUTDOWN_WAIT_ACK && _isDue(millis(), _shutdownDeadline)) {
        outbox.clear();
        _closeTransport(Esp8266BaseMQTTDisconnectReason::USER_OK, false);
        _finishShutdown(Esp8266BaseMQTTShutdownResult::PUBACK_TIMEOUT);
    }
}

void Esp8266BaseMQTT::_startGracefulDisconnect() {
    _state = Esp8266BaseMQTTState::SHUTDOWN_DISCONNECTING;
    Esp8266BaseMQTTShutdownResult result = Esp8266BaseMQTTShutdownResult::DISCONNECT_TIMEOUT;
    if (!_isDue(millis(), _shutdownDeadline)) {
        if (!_sendDisconnectPacket()) {
            result = Esp8266BaseMQTTShutdownResult::DISCONNECT_FAILED;
        } else if (Esp8266BaseInternal::flushBeforeDeadline(
                       client, _shutdownDeadline, []() { return millis(); })) {
            result = Esp8266BaseMQTTShutdownResult::SUCCESS;
        }
    }
    _closeTransport(Esp8266BaseMQTTDisconnectReason::USER_OK, false);
    _finishShutdown(result);
}

bool Esp8266BaseMQTT::_sendDisconnectPacket() {
    const uint8_t packet[] = {0xe0, 0};
    return writeExact(packet, sizeof(packet));
}

void Esp8266BaseMQTT::_finishShutdown(Esp8266BaseMQTTShutdownResult result) {
    _shutdownResult = result;
    _shutdownPacketId = 0;
    _state = Esp8266BaseMQTTState::PAUSED;
    ESP8266BASE_LOG_I_P("MQTT", "shutdown_finished result=%s transport_open=%s",
                      shutdownResultName(), transportOpen ? "yes" : "no");
}

void Esp8266BaseMQTT::resumeAfterShutdown() {
    if (!_shutdownActive) return;
    _shutdownActive = false;
    _shutdownPacketId = 0;
    _retryAt = millis();
    _retryDelay = ESP8266BASE_MQTT_RETRY_INITIAL_MS;
    _state = Esp8266BaseWiFi::isConnected() ? Esp8266BaseMQTTState::WAITING_TIME
                                             : Esp8266BaseMQTTState::WAITING_WIFI;
}

bool Esp8266BaseMQTT::pauseForOTA() {
    if (!_configured || !_begun || !transportOpen) {
        _shutdownActive = true;
        _shutdownResult = Esp8266BaseMQTTShutdownResult::NOT_CONNECTED;
        _state = Esp8266BaseMQTTState::PAUSED;
        return true;
    }
    if (!_shutdownActive) return false;
    while (_state != Esp8266BaseMQTTState::PAUSED) {
        _handleShutdown();
        yield();
    }
    return !transportOpen && _shutdownResult == Esp8266BaseMQTTShutdownResult::SUCCESS;
}

void Esp8266BaseMQTT::resumeAfterOTAFailure() { resumeAfterShutdown(); }
void Esp8266BaseMQTT::keepPausedAfterOTASuccess() {
    _shutdownActive = true;
    _state = Esp8266BaseMQTTState::PAUSED;
}

bool Esp8266BaseMQTT::_isRecoverable(Esp8266BaseMQTTDisconnectReason reason) {
    return reason == Esp8266BaseMQTTDisconnectReason::SERVER_UNAVAILABLE ||
           reason == Esp8266BaseMQTTDisconnectReason::TCP_DISCONNECTED;
}

void Esp8266BaseMQTT::_noteRecoveryFailure(Esp8266BaseMQTTDisconnectReason reason) {
    if (!_isRecoverable(reason)) return;
    const uint32_t now = millis();
    if (!_recoveryActive) {
        _recoveryActive = true;
        _recoveryStartedAt = now;
        _recoveryRadioResetBaseline = Esp8266BaseWiFi::radioResetCount();
        _restartRetryAt = now;
#if ESP8266BASE_USE_JOURNAL
        Esp8266BaseJournal::record(JNL_RECOVERY, 0, static_cast<int16_t>(reason), 0, 0);
#endif
    }
    if (_consecutiveTransportFailures < 0xFFU) ++_consecutiveTransportFailures;
    if (_recoveryFailureCount < 0xFFFFU) ++_recoveryFailureCount;
#if ESP8266BASE_USE_WATCHDOG
    Esp8266BaseWatchdog::setApplicationReady(false);
#endif
    const bool recoveryDue = _lastWifiRecoveryAt == 0U ||
        static_cast<uint32_t>(now - _lastWifiRecoveryAt) >=
            ESP8266BASE_MQTT_WIFI_RECOVERY_COOLDOWN_MS;
    if (ESP8266BASE_MQTT_WIFI_RECOVERY_FAILURE_COUNT > 0 &&
        _consecutiveTransportFailures >= ESP8266BASE_MQTT_WIFI_RECOVERY_FAILURE_COUNT &&
        recoveryDue && Esp8266BaseWiFi::recoverStation()) {
        ESP8266BASE_LOG_W_P("MQTT",
                          "transport_failures_triggered_wifi_recovery failures=%u cooldown_ms=%lu",
                          static_cast<unsigned>(_consecutiveTransportFailures),
                          static_cast<unsigned long>(ESP8266BASE_MQTT_WIFI_RECOVERY_COOLDOWN_MS));
        _consecutiveTransportFailures = 0;
        _lastWifiRecoveryAt = now;
        _state = Esp8266BaseMQTTState::WAITING_WIFI;
    }
}

void Esp8266BaseMQTT::_handleEscalatedRecovery(uint32_t now) {
#if ESP8266BASE_USE_WATCHDOG
    if (!_recoveryActive ||
        static_cast<uint32_t>(now - _recoveryStartedAt) < ESP8266BASE_MQTT_MCU_RECOVERY_AFTER_MS ||
        static_cast<uint8_t>(Esp8266BaseWiFi::radioResetCount() - _recoveryRadioResetBaseline) <
            ESP8266BASE_MQTT_MCU_RECOVERY_RADIO_RESETS ||
        !_isDue(now, _restartRetryAt)) return;
    const Esp8266BaseRestartDecision decision = Esp8266BaseWatchdog::requestRestart(
        Esp8266BaseRecoveryCause::NETWORK_UNRECOVERABLE);
    // Guard denial (for example an active relay run) is re-evaluated at a low
    // rate. Budget/cooldown denial is also rate-limited and remains visible.
    _restartRetryAt = now + 60000UL;
    if (decision != Esp8266BaseRestartDecision::RESTARTING) {
        ESP8266BASE_LOG_W_P("MQTT", "mcu_recovery_deferred decision=%u outage_s=%lu radio_resets=%u",
                          static_cast<unsigned>(decision),
                          static_cast<unsigned long>((now - _recoveryStartedAt) / 1000UL),
                          static_cast<unsigned>(Esp8266BaseWiFi::radioResetCount() -
                                                _recoveryRadioResetBaseline));
    }
#else
    (void)now;
#endif
}

void Esp8266BaseMQTT::_scheduleRetry() {
    _retryAt = millis() + _retryDelay;
    if (_retryDelay < ESP8266BASE_MQTT_RETRY_MAX_MS) {
        const uint32_t next = _retryDelay * 2UL;
        _retryDelay = next > ESP8266BASE_MQTT_RETRY_MAX_MS ? ESP8266BASE_MQTT_RETRY_MAX_MS : next;
    }
    _state = Esp8266BaseMQTTState::BACKOFF;
}

bool Esp8266BaseMQTT::_isDue(uint32_t now, uint32_t due) { return millisDue(now, due); }

void Esp8266BaseMQTT::_disconnectForGate(Esp8266BaseMQTTState waitingState) {
    if (transportOpen) _closeTransport(Esp8266BaseMQTTDisconnectReason::TCP_DISCONNECTED, false);
    _state = waitingState;
}

void Esp8266BaseMQTT::_captureTlsError() {
    char detail[sizeof(lastTlsText)] = "";
    const int code = client.getLastSSLError(detail, sizeof(detail));
    if (!code) return;
    lastTlsCode = code;
    strncpy(lastTlsText, detail, sizeof(lastTlsText) - 1);
    lastTlsText[sizeof(lastTlsText) - 1] = '\0';
}

