tangyangguang/Esp8266Base/src/Esp8266BaseMQTT.cpp
void Esp8266BaseMQTT::_closeTransport(Esp8266BaseMQTTDisconnectReason reason,
    bool scheduleRetry, bool notifyApplication) {
    const bool wasConnected = mqttConnected;
    const size_t discarded = _cleanSession ? outbox.size() : 0;
    _captureTlsError();
#if ESP8266BASE_USE_JOURNAL
    {
        const uint8_t rc = static_cast<uint8_t>(reason);
        const int tls = lastTlsCode;
        Esp8266BaseJournal::record(JNL_MQTT_CLOSED, 0, static_cast<int16_t>(rc),
                                   tls == 0 ? 0xFFFFU : static_cast<uint16_t>(tls), 0);
    }
#endif
    client.stop();
    transportOpen = false;
    mqttConnected = false;
#if ESP8266BASE_USE_WATCHDOG
    Esp8266BaseWatchdog::setApplicationReady(false);
#endif
    pingOutstanding = false;
    rx.reset();
    outbox.prepareReconnect(_cleanSession);
    _lastReason = reason;
    if (_cleanSession && discarded) ESP8266BASE_LOG_I_P("MQTT", "session_queue_discarded clean_session=yes packets=%u", static_cast<unsigned>(discarded));
    ESP8266BASE_LOG_W_P("MQTT", "transport_closed reason=%s retry=%s tls_code=%d queued=%u",
                      lastDisconnectReasonName(), scheduleRetry ? "yes" : "no", lastTlsCode,
                      static_cast<unsigned>(outbox.size()));
    if (notifyApplication && wasConnected && _disconnectedCallback) _disconnectedCallback(reason);
    if (scheduleRetry && !_shutdownActive) {
        _noteRecoveryFailure(reason);
        if (!Esp8266BaseWiFi::isConnected()) {
            _state = Esp8266BaseMQTTState::WAITING_WIFI;
            return;
        }
        _scheduleRetry();
    }
}

void Esp8266BaseMQTT::_onConnect(bool sessionPresent) {
    if (_shutdownActive) return;
    mqttConnected = true;
#if ESP8266BASE_USE_JOURNAL
    Esp8266BaseJournal::record(JNL_MQTT_UP, 0, 0, 0, 0);
#endif
    // Do not clear recovery evidence on CONNACK. Only the application layer's
    // markConnectionReady() proves that required subscriptions and readiness
    // messages completed.
    _state = Esp8266BaseMQTTState::CONNECTED;
    _lastReason = Esp8266BaseMQTTDisconnectReason::NONE;
    ESP8266BASE_LOG_I_P("MQTT", "connected session_present=%s free_heap=%u max_block=%u",
                      sessionPresent ? "yes" : "no", static_cast<unsigned>(ESP.getFreeHeap()),
                      static_cast<unsigned>(ESP.getMaxFreeBlockSize()));
    if (_connectedCallback) _connectedCallback(sessionPresent);
}

void Esp8266BaseMQTT::_onDisconnect(Esp8266BaseMQTTDisconnectReason reason) { _closeTransport(reason, !_shutdownActive); }

void Esp8266BaseMQTT::_onMessage(uint8_t qos, bool dup, bool retain, uint16_t packetId,
    const char* topic, const uint8_t* payload, size_t len, size_t index, size_t total) {
    if (!_shutdownActive && _messageCallback) _messageCallback(qos, dup, retain, packetId, topic, payload, len, index, total);
}

void Esp8266BaseMQTT::_onSubscribeAck(uint16_t packetId, const uint8_t* codes, size_t length) {
    const bool accepted = subackAccepted(codes, length);
    ESP8266BASE_LOG_I_P("MQTT", "%s packet_id=%u codes=%u",
                      accepted ? "suback_accepted" : "suback_rejected",
                      static_cast<unsigned>(packetId), static_cast<unsigned>(length));
    if (_subscribeAckCallback) _subscribeAckCallback(packetId, codes, length);
}

void Esp8266BaseMQTT::_onPublishAck(uint16_t packetId) {
    if (!outbox.acknowledge(PacketKind::PUBLISH, packetId)) {
        ESP8266BASE_LOG_W_P("MQTT", "puback_ignored packet_id=%u",
                          static_cast<unsigned>(packetId));
        return;
    }
    if (_shutdownActive && _state == Esp8266BaseMQTTState::SHUTDOWN_WAIT_ACK && packetId == _shutdownPacketId) {
        _shutdownPacketId = 0;
        _startGracefulDisconnect();
    }
    if (_publishAckCallback) _publishAckCallback(packetId);
}

void Esp8266BaseMQTT::_onClientError(uint16_t packetId, Esp8266BaseMQTTClientError error) {
    ESP8266BASE_LOG_E_P("MQTT", "client_error packet_id=%u error=%u", static_cast<unsigned>(packetId), static_cast<unsigned>(error));
    if (_clientErrorCallback) _clientErrorCallback(packetId, error);
}

#endif
